const data = [

  {
    url: '/index', pageName: '首页', item: [{
      title: '网站介绍', content: '本网站继承多个系统,包含:APS,进存销,盘点. 进入每个页面可单独查看该页面帮助文档.'
    }, {
      title: 'APS系统',
      content: '实现商品管理,工作日历,工作班次, 工段, 工位,状态, 车间, 工艺路径, 销售特征, 工程特征,零件, 预测生产, 订单, 排产, 排程, 零件等功能'
    }, {
      title: '进存销系统', content: '实现进存销, 进销存, 进销存报表等功能'
    }, {
      title: '盘点系统', content: '实现盘点, 盘点报表等功能'
    }]
  }, {
    url: '/aps/sale/index', pageName: 'APS-销售特征', //
    // 销售特征管理页面
    item: [{
      title: '操作前置条件', content: '无'
    }, {
      title: '销售特征简介', content: '按商品特征进行分组,并整理每个组中含有那些具体的值'
    }, {
      title: '销售特征添加', content: '先增加销售特征分组,再增加销售特征明显,一对多'
    }, {
      title: '销售特征修改', content: '只能修改名称,编码'
    }, {
      title: '销售特征删除', content: '删除销售特征值后,才能删除销售特征组'
    }] //
  }, {
    url: '/aps/project/index', pageName: 'APS-状态列表-工程特征', item: [{
      title: '操作前置条件', content: '无'
    }, {
      title: '工程特征简介',
      content: '按商品特征进行分组,并整理每个组中含有那些具体的值'
        + ',商品每个值对应零件使用情况'
    }, {
      title: '工程特征添加', content: '先增加工程特征分组,再增加工程特征'
    }, {
      title: '工程特征修改', content: '只能修改名称,编码'
    }, {
      title: '工程特征删除', content: '删除工程特征值后,才能删除工程特征'
    }]
  }, {
    url: '/aps/status/index', pageName: 'APS-状态列表', item: [{
      title: '操作前置条件', content: '无'
    }, {
      title: '状态简介', content: '定义商品状态'
    }, {
      title: '状态添加', content: '添加状态'
    }, {
      title: '状态修改', content: '修改状态'
    }, {
      title: '状态删除', content: '删除状态'
    }]
  }, {
    url: '/aps/section/index', pageName: 'APS-工段管理', item: [{
      title: '操作前置条件', content: '无'
    }, {
      title: '工段简介', content: '流水线中每个工段的定义'
    }, {
      title: '工段添加', content: '添加工段'
    }, {
      title: '工段修改', content: '修改工段'
    }, {
      title: '工段删除', content: '删除工段'
    }]
  }, {
    url: '/aps/station/index', pageName: 'APS-工位管理', item: [{
      title: '操作前置条件', content: '无'
    }, {
      title: '工位简介', content: '工位是流水线中每个工段的具体位置'
    }, {
      title: '工位添加', content: '添加工位'
    }, {
      title: '工位修改', content: '修改工位'
    }, {
      title: '工位删除', content: '删除工位'
    }]
  }, {
    url: '\'/aps/room/index\'', pageName: 'APS-车间管理', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 工厂 </li><li>工段</li><li>工位</li><li>状态</li><ul>'
    }, {
      title: '车间简介',
      content: '车间是配置流水线的必须条件,每个车间可以单独设置自己的工段,工位以及工位对应的状态与耗时时间等,如果是缓冲车间,则可以增加缓冲状态,耗时为指定时间'
    }, {
      title: '车间添加', content: '依次增加车间的工段,工位,工位对应的状态(商品状态)以及当前工位的耗时时间'
    }, {
      title: '车间修改', content: '同添加'
    }, {
      title: '车间删除', content: '删除车间,流水线中在用的全部删除'
    }]
  }, {
    url: '/aps/process/path/index', pageName: 'APS-流水线', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 车间的前置条件 </li><li>车间</li><ul>'
    }, {
      title: '流水线简介', content: '流水线是商品预测零件,商品排产中重要的组成, 基于该流水线可以计算零件的使用情况'
    }, {
      title: '流水线添加', content: '流水线可以增加对应的车间, 车间按需添加'
    }, {
      title: '流水线修改', content: '修改流水线车间配置'
    }]
  }, {

    pageName: 'APS-零件', url: '/aps/bom/index', item: [{
      title: '操作前置条件', content: '无'
    }, {
      title: '零件简介', content: '零件最基础数据, 包含 编码,名称,成本,单位,库存等'
    }, {
      title: '零件添加', content: '添加零件 增加零件信息'
    }, {
      title: '零件修改', content: '修改零件 修改零件信息'
    }, {
      title: '零件删除', content: '删除零件'
    }]
  }, {
    pageName: 'APS-商品零件配置', url: '/aps/goodsBom/index', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 工厂 </li><li>商品</li><li>工位</li><li>零件</li><ul>'
    }, {
      title: '零件配置简介', content: '商品零件配置,商品与零件的配置关系,多个商品公用一个零件及其基本信息'
    }, {
      title: '零件配置添加',
      content: '添加商品零件,选择工厂,商品,使用工位,了零件等, 配置在次使用的使用量及单位, 使用表达式可以为 . 默认当前工位无条件使用. '
        + ' 可以配置配置工程特征值确定其使用范围,格式:(AA001&&AC002)&&(AB001||AB002) . 是否关注,当为‘是’时,排产或预测将该零件置顶显示'
    }, {
      title: '零件配置修改', content: '修改零件配置'
    }, {
      title: '零件配置删除', content: '删除零件配置'
    }]
  }, {
    pageName: 'APS-零件购买计划', url: '/aps/bomBuyPlan/index', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 零件 </li><li>零件配置</li><li>零件购买计划</li><ul>'
    }, {
      title: '零件购买计划简介', content: '零件购买计划,包含购买总价,零件清单等'
    }, {
      title: '零件购买计划添加', content: '零件购买计划,目前只有排产后,根据零件使用情况可以生成零件采购计划'
    }]
  }, {
    pageName: 'APS-商品管理', url: '/aps/goods/index', item: [{
      title: '操作前置条件', content: ' 以下必须配置完成: <ul> <li> 工厂 </li><ul>'
    }, {
      title: '商品简介', content: '商品基础数据,包含 编码,名称,制造工艺路径'
    }, {
      title: '商品添加', content: '添加商品 增加商品信息'
    }, {
      title: '商品修改', content: '修改商品 修改商品信息'
    }, {
      title: '商品删除', content: '删除商品'
    }] //
  }, {
    pageName: 'APS-商品销售特征绑定', url: '/aps/goods/sale/index', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 商品 </li><li>商品销售特征</li><ul>'
    }, {
      title: '商品销售特征绑定简介',
      content: '商品销售特征绑定,当前商品可以使用那些销售特征, 以及当前销售特征值是否参与预测'
    }]
  }, {
    pageName: 'APS-商品销售特征绑定',
    url: '/aps/goods/sale/project/index',
    item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 商品 </li><li>商品销售特征</li><li>商品工程特征</li><ul>'
    }, {
      title: '商品销售特征绑定简介',
      content: '销售特征与工程特征的绑定, 可以将单一的销售特征按比例分派给不同的工程特征,这样可以按工程特征获取到不同的零件'
    }] //
  }, {
    pageName: 'APS-商品预测', url: '/aps/goods/forecast/index', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 商品 </li><li>零件配置</li><li>零件购买计划</li><li>商品销售特征</li><li>商品工程特征</li><li>商品销售特征绑定</li><li>商品工程特征绑定</li><li>商品预测</li><ul>'
    }, {
      title: '商品预测简介',
      content: '按照商品需要生成数量,以及其对应的销售特征比例,可以推算每种商品造,如: 造100个商品,其中 红20%,黑80%,有天窗40%,无天窗60%, '
        + '可以求出 红+有天窗,红+无天窗, 黑+有天窗,黑+无天窗四种配置的商品各自需要制造多少'
    }, {
      title: '商品预测添加',
      content: '预测分为以下几步 <ol> '
        + '<li>创建版本: 选择需要预测的商品,设置版本编码名称,以及需要预测的时间段</li> '
        + '<li>下载模板: 下载数据模板,填写每月需要生成数据,以及每个月中各自销售特征的占比</li> '
        + '<li>上传模板: 上传编写好的预测数据</li> '
        + '<li>开始计算: 开始计算上传数据</li> '
        + '<li>发布: 如果认同次数据,可以发布到主版本,进行数据确认</li> '
        + '</ol> '
    }, {
      title: '商品预测删除', content: '删除此预测信息'
    }], //
    '/aps/goods/forecast/main/index': [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 商品 </li><li>零件配置</li><li>商品销售特征</li><li>商品工程特征</li><li>商品销售特征绑定</li><li>商品工程特征绑定</li><li>商品预测</li><ul>'
    }, {
      title: '商品预测主版本简介', content: '商品预测主版本,可以查看各个版本的预测数据,以及发布后的数据'
    }] //
  }, {
    //
    url: '/aps/order/index', pageName: 'APS-订单', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 商品 </li><li>零件配置</li><li>零件购买计划</li><li>商品销售特征</li><li>商品工程特征</li><li>商品销售特征绑定</li><li>商品工程特征绑定</li><ul>'
    }, {
      title: '订单简介', content: '订单,可以查看订单信息,以及订单状态'
    }, {
      title: '订单添加', content: '订单添加 待定'
    }, {
      title: '订单修改', content: '订单修改 待定'
    }, {
      title: '订单删除', content: '订单删除 待定'
    }, {
      title: '订单确认', content: '订单确认 待定'
    }, {
      title: '状态列表', content: '查看订单在流水线中每个节点的预计时间和实际时间'
    }

    ] //
  }, {
    //
    url: '/aps/make_capacity_factory/index', pageName: 'APS-工厂产能', item: [{
      title: '操作前置条件', content: ' 以下必须配置完成: <ul> <li> 工厂 </li></ul>'
    }, {
      title: '工厂产能简介',
      content: '可以设置每个工厂每天可以生产最大最小数量,比如 2024-01-01当天最少1个,最大1000个'
    }, {
      title: '工厂产能添加',
      content: '选择某个工厂,可以添加多个时间段的最大最工厂产能, 当日期冲突时, 按最后的日期配置为准,'
        + ' <br/> 如: 配置 2024-01-01到 2024-12-31 配置10-20个, 再增加配置 2024-05-01到2024-05-31 配置 40-60 <br/>'
        + '结果为: 2024-01-01到2024-04-30 生产数为 10-20. <br/>  2024-05-01到2024-05-31 生产数为 40-60 <br/>'
        + '  2024-06-01到2024-04-30 生产数为 10-20. '
    }, {
      title: '工厂产能删除', content: '删除工厂当月产能'
    }] //
  }, {
    url: '/aps/make/make_capacity_sale_config/index',
    pageName: 'APS-销售特征产能',
    item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 工厂 </li><li>商品销售特征</li><li>商品工程特征</li><li>商品销售特征绑定</li><li>商品工程特征绑定</li><li>商品预测</li><ul>'
    }, {
      title: '销售特征产能简介',
      content: '可以设置每个销售特征每天可以生产最大最小数量,比如 2024-01-01当天最少1个,最大1000个'
    }, {
      title: '销售特征产能添加',
      content: '选择某个销售特征,可以添加多个时间段的最大最销售特征产能, 当日期冲突时, 按最后的日期配置为准,'
        + ' <br/> 如: 配置 2024-01-01到 2024-12-31 配置10-20个, 再增加配置 2024-05-01到2024-05-31 配置 40-60 <br/>'
        + '结果为: 2024-01-01到2024-04-30 生产数为 10-20. <br/>  2024-05-01到2024-05-31 生产数为 40-60 <br/>'
        + '  2024-06-01到2024-04-30 生产数为 10-20. '
    }, {
      title: '销售特征产能删除', content: '删除销售特征当月产能'
    }]
  }, {
    //
    url: 'aps/make/make_capacity_goods/index', pageName: 'APS-商品产能', item: [

      {
        title: '操作前置条件', content: ' 以下必须配置完成: <ul> <li> 商品 </li><ul>'
      }, {
        title: '商品产能简介',
        content: '可以设置每个商品每天可以生产最大最小数量,比如 2024-01-01当天最少1个,最大1000个'
      }, {
        title: '商品产能添加',
        content: '选择某个商品,可以添加多个时间段的最大最商品产能, 当日期冲突时, 按最后的日期配置为准,'
          + ' <br/> 如: 配置 2024-01-01到 2024-12-31 配置10-20个, 再增加配置 2024-05-01到2024-05-31 配置 40-60 <br/>'
          + '结果为: 2024-01-01到2024-04-30 生产数为 10-20. <br/>  2024-05-01到2024-05-31 生产数为 40-60 <br/>'
          + '  2024-06-01到2024-04-30 生产数为 10-20. '
      }]
  }, {

    //
    url: '/aps/make/constraint/index', pageName: 'APS-排产约束条件', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 工厂 </li><li>商品销售特征</li><li>商品工程特征</li><li>商品销售特征绑定</li><li>商品工程特征绑定</li><li>商品预测</li><ul>'
    }, {
      title: '约束条件简介',
      content: '约束条件可以作为排产的第一步筛选, 如根据订单紧急程度,价格, 交付地址,创建时间,交付时间等条件进行优先排序'
    }, {
      title: '约束条件添加',
      content: '增加筛选条件后,点击约束,可以按各种纬度进行订单的初步筛选,如价格,交付时间,状态等,可以筛选后可以根据某些字段进行排序. 如果纬度可以进行二次细分, 如交付时间相同下, 再按紧急程度进行排序.'
        + '<br/> ,筛选可以进行嵌套,支持多层筛选与排序. 筛选的条件可以在排产第二步骤中列表显示.'
    }, {
      title: '约束条件删除', content: '删除约束条件'
    }] //
  }, {

    url: '/aps/scheduling/index', pageName: 'APS-排产', item: [{
      title: '操作前置条件',
      content: ' 以下必须配置完成: <ul> <li> 工厂 </li><li>工厂产能</li> <li>商品</li> <li>商品产能</li>'
        + ' <li>零件</li> <li>订单</li> <li>工艺路径</li>  <li>日历</li>  <li>班次</li> <ul>'
    }, {
      title: '排产简介',
      content: '工厂按订单生产,可以按指定约束规则进行订单的筛选与排序, 再根据工厂产能,商品产能等按天纬度确定每天需要生产的订单.<br/>'
        + '排产结果中显示约束使用的字段,产能使用的字段等.'
    }, {
      title: '排产添加',
      content: '添加分为4步 , <br/>1:<br/> 创建版本,包含 版本编号,名称, 排产约束条件, 排产天数(以明天为基准的第N个自然日),零件汇总结束日期(统计当前日期内零件使用量)'
        + ',点击下一步.<br/>2:<br/>'
        + '查看使用约束条件后,可以生产订单排序结果,将订单按约束规则进行分组排序,并标名生产序号.'
        + '查看订单排产结果, 左侧标红日期显示为纬度产能缺少,可以点击多个日期进行排产结果查询, 点击查询零件使用, 可以查询零件使用汇总,并生成零件采购计划'
        + ',点击下一步.<br/>4:<br/> 点击完成, 将排产标记为排产结束'
    }, {
      title: '生成零件采购计划',
      content: '点击零件,可以查看零件使用情况, 点击生成采购计划, 可以按零件结束日期内使用数对比零件库存,生成零件采购计划'
    }] //
  }, {
    url: '/prop/spec/index', pageName: '基础-日历', item: [{
      title: '操作前置条件', content: ' 以下必须配置完成: <ul> <li> 工厂 </li><ul>'
    }, {
      title: '日历简介', content: '日历是工厂的上班日期,该日历目前使用于排产或预测中工作日的获取'
    }, {
      title: '日历设置',
      content: '添加日历,可以设置工厂的排产日历,如周一到周五为工作日,周六周天为休息日, 可以指定日期段为工作日或休息日,已适应工工厂放假或加班需求'
    }, {
      title: '日历删除', content: '删除日历'
    }, {
      title: '日历查看', content: '可以按月纬度,查看该月的上班情况'
    }] //
  }, {
    url: '/prop/shift/index', pageName: '班次', item: [{
      title: '操作前置条件', content: ' 以下必须配置完成: <ul> <li> 工厂 </li><ul>'
    }, {
      title: '班次简介',
      content: '班次是工厂的班次,如该工厂为三班,或两班.并指定当前班次的上班时间,该上班时间+工作日期用于零件计算使用'
    }, {
      title: '班次添加',
      content: '添加班次,,可以设置工厂的排产班次,多个班次使用一条数据,创建多个班次,如8:00-17:00为一班,17:00-24:00为一班'
    }, {
      title: '班次删除', content: '删除班次'
    }]
  }
  , {
    url: '/aps/order/timeline/index', pageName: '订单-订单时间线', item: [

      {
        title: '操作前置条件', content: '订单排产或订单状态变更'
      }

    ]
  }

]
export default data
